In [1]:
import numpy as np
import pandas as pd

## [문제1]  
1. 매출 데이터를 담은 Series를 만들고, 멀티 인덱스를 설정하세요  
• 인덱스: 지역-지점  
• 값: 매출  
서울 전체 매출을 조회하세요  
부산 해운대점 매출을 조회하세요

In [2]:
# 매출 데이터를 담은 Series를 만들고, 멀티 인덱스를 설정하세요
s = pd.Series([120,100,90,80],
              index = [['서울','서울','부산','부산'],['강남점','강북점','해운대점','서면점']])
s

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [3]:
# 서울 전체 매출을 조회하세요
s['서울']

강남점    120
강북점    100
dtype: int64

In [4]:
# 부산 해운대점 매출을 조회하세요
s.loc[('부산','해운대점')]

np.int64(90)

## [문제2]
2. 쇼핑몰의 판매량 데이터를 담은 Series를 만들고, 멀티 인덱스을 설정하세요  
• 인덱스 : 카테고리-상품명  
• 값: 판매량  
전자제품 카테고리 전체 판매량을 조회하세요  
식품 카테고리의 라면 판매량을 조회하세요

In [5]:
# 쇼핑몰의 판매량 데이터를 담은 Series를 만들고, 멀티 인덱스을 설정하세요
s = pd.Series([300,250,500,400],
              index=[['전자제품','전자제품','식품','식품'],
                     ['노트북','휴대폰','라면','과자']])
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [6]:
# 전자제품 카테고리 전체 판매량을 조회하세요
s['전자제품']

노트북    300
휴대폰    250
dtype: int64

In [7]:
# 식품 카테고리의 라면 판매량을 조회하세요
s.loc[('식품','라면')]

np.int64(500)

## [문제3]
3. 도서관의 대출 건수를 담은 Series를 만들고 멀티 인덱스를 설정하세요  
• 인덱스: 학년-과목  
• 값: 대출 건수  
1학년 전체 대출 건수를 조회하세요  
2학년 수학 과목의 대출 건수를 조회하세요

In [8]:
# 도서관의 대출 건수를 담은 Series를 만들고 멀티 인덱스를 설정하세요
s = pd.Series([40,35,50,45],
              index=[['1학년','1학년','2학년','2학년'],['국어','국어','수학','수학']])
s

1학년  국어    40
     국어    35
2학년  수학    50
     수학    45
dtype: int64

In [9]:
# 1학년 전체 대출 건수를 조회하세요
s['1학년']

국어    40
국어    35
dtype: int64

In [11]:
# 2학년 수학 과목의 대출 건수를 조회하세요
s.loc[('2학년','수학')]

2학년  수학    50
     수학    45
dtype: int64

## [문제4]
1. 도서관 대출 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요  
• 행 인덱스: 도서관-월  
• 열: 소설, 과학  
• 값: 대출 건수  
중앙도서관 전체 대출 건수를 조회하세요  
시립도서관 2월의 과학 대출 건수를 조회하세요

In [19]:
# 도서관 대출 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
df = pd.DataFrame([[125,45],[95,60],[150,70],[110,55]],
                index=[['중앙도서관','중앙도서관','시립도서관','시립도서관'],
                         ['1월','2월','1월','2월']],
                 columns=['소설','과학']
                )
df

           소설  과학
중앙도서관 1월  125  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [20]:
# 중앙도서관 전체 대출 건수를 조회하세요
df.loc['중앙도서관']

     소설  과학
1월  125  45
2월   95  60

In [21]:
# 시립도서관 2월의 과학 대출 건수를 조회하세요
df.loc[('시립도서관','2월'),'과학']

np.int64(55)

## [문제5]
2. 자동차 판매량 데이터를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요  
• 행 인덱스: 연도-차종  
• 열: 1분기, 2분기  
• 값: 판매 대수  
2022년 전체 판매량을 조회하세요  
2023년 세단의 2분기 판매량을 조회하세요

In [26]:
df = pd.DataFrame([[320,280],[210,230],[400,390],[180,200]],
                  index = [['2022년','2022년','2023년','2023년'],
                              ['SUV','세단','SUV','세단']],
                  columns = ['1분기','2분기'] )
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [28]:
# 2022년 전체 판매량을 조회하세요
df.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [29]:
# 2023년 세단의 2분기 판매량을 조회하세요
df.loc[('2023년','세단'),'2분기']

np.int64(200)

## [문제6]
3. 호텔 예약 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요  
• 행 인덱스: 지점-월  
• 열: 싱글룸, 더블룸  
• 값: 예약 건수  
서울지점 전체 예약 건수를 조회하세요  
부산지점 8월의 더블룸 예약 건수를 조회하세요

In [35]:
# 호텔 예약 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
df = pd.DataFrame([[45,30],[50,35],[60,40],[55,38]],
                  index=[['서울지점','서울지점','부산지점','부산지점'],
                        ['7월','8월','7월','8월']],
                  columns=['싱글룸','더블룸'])
df

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [36]:
# 서울지점 전체 예약 건수를 조회하세요
df.loc['서울지점']

    싱글룸  더블룸
7월   45   30
8월   50   35

In [37]:
# 부산지점 8월의 더블룸 예약 건수를 조회하세요
df.loc[('부산지점','8월'),'더블룸']

np.int64(38)

## [문제7]
4. 쇼핑몰 주문 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요  
• 행 인덱스: 카테고리-상품  
• 열: 1월, 2월  
• 값: 주문 건수  
가전 카테고리 전체 주문 건수를 조회하세요  
식품 카테고리 라면의 2월 주문 건수를 조회하세요

In [38]:
# 쇼핑몰 주문 건수를 담은 DataFrame를 만들고, 멀티 인덱스를 설정하세요
df = pd.DataFrame([[120,140],[80,95],[200,220],[150,160]],
                  index=[['가전','가전','식품','식품'],
                        ['노트북','청소기','라면','과자']],
                  columns=['1월','2월'])
df

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [39]:
# 가전 카테고리 전체 주문 건수를 조회하세요
df.loc['가전']

      1월   2월
노트북  120  140
청소기   80   95

In [40]:
# 식품 카테고리 라면의 2월 주문 건수를 조회하세요
df.loc[('식품','라면'),'2월']

np.int64(220)

## [문제8]

In [41]:
# 1.고객 데이터를 담은 DataFrame와 주문 데이터를 담은 DataFrame를 만들고, 고객ID 기준으로 합치세요
# → 결과를 보고 어떤 join 방식을 쓸지 결정하세요
df1 = pd.DataFrame({'고객ID':[101,102,103], '이름':['철수','영희','민수']}) 
print(df1)
df2 = pd.DataFrame({'고객ID':[101,104,102], '상품':['노트북','청소기','책']})
df2

   고객ID  이름
0   101  철수
1   102  영희
2   103  민수

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [43]:
pd.merge(df1,df2, on='고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [45]:
# 2. 직원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들고,
# 사번 기준으로 합치세요
df1 = pd.DataFrame({'사번':[1,2,3], '이름':['홍길동','임꺽정','이몽룡']}) 
print(df1)
df2 = pd.DataFrame({'사번':[1,3], '부서':['영업','개발']}) 
print(df2)

   사번   이름
0   1  홍길동
1   2  임꺽정
2   3  이몽룡
   사번  부서
0   1  영업
1   3  개발

In [46]:
pd.merge(df1,df2, on='사번', how='left')

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [47]:
# 3. 상품 데이터를 담은 DataFrame와 재고 데이터를 담은 DataFrame를 만들고,
# 상품코드 기준으로 합치세요

df1 = pd.DataFrame({'상품코드':['A1','A2','A3'], '상품명':['노트북','청소기','책상']}) 
print(df1)
df2 = pd.DataFrame({'상품코드':['A2','A3','A4'], '재고':[5,8,10]}) 
print(df2)

  상품코드  상품명
0   A1  노트북
1   A2  청소기
2   A3   책상
  상품코드  재고
0   A2   5
1   A3   8
2   A4  10

In [48]:
pd.merge(df1,df2, on='상품코드', how='right')

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [49]:
# 4. 학생 데이터를 담은 DataFrame와 동아리 데이터를 담은 DataFrame를 만들고,
# 학번 기준으로 합치세요

df1 = pd.DataFrame({'학번':[1,2,3], '이름':['지훈','서연','민지']}) 
print(df1)
df2 = pd.DataFrame({'학번':[2,4], '동아리':['축구부','합창단']}) 
print(df2)

   학번  이름
0   1  지훈
1   2  서연
2   3  민지
   학번  동아리
0   2  축구부
1   4  합창단

In [51]:
pd.merge(df1,df2, on='학번', how ='outer')

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

## [문제9]

In [52]:
# 1. 사원 데이터를 담은 DataFrame와 부서 데이터를 담은 DataFrame를 만들고, 하나로 합치세요  
# → 결과를 보고 어떤 방향으로 붙일지 결정하세요 
df1 = pd.DataFrame({'사번':[1,2], '이름':['홍길동','임꺽정']}) 

df2 = pd.DataFrame({'부서':['영업','개발']})

   사번   이름
0   1  홍길동
1   2  임꺽정
   부서
0  영업
1  개발

In [54]:
pd.concat([df1,df2], axis=1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [57]:
# 2. 세 개의 매출 데이터 DataFrame를 만들고, 하나로 합치세요
# → 결과를 보고 어떤 옵션(방향, 인덱스)을 쓸지 결정하세요
df1 = pd.DataFrame({'매출':[100,200]})
df2 = pd.DataFrame({'매출':[150,250]}) 
df3 = pd.DataFrame({'매출':[300,400]})

In [59]:
pd.concat([df1,df2,df3], ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [60]:
# 3. 두 개의 학생 점수 데이터를 담은 DataFrame를 만들고, 하나로 합치세요
df1 = pd.DataFrame({'이름':['철수','영희'],'국어':[85,90]})
df2 = pd.DataFrame({'이름':['민수','지연'],'수학':[78,92]})

In [61]:
pd.concat([df1,df2], axis=1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

## [문제10]

In [62]:
# 1. 쇼핑몰 판매 데이터를 담은 DataFrame를 만들고, pivot을 이용해 카테고리별 월 매출을 출력하세요
df = pd.DataFrame({'카테고리': ['식품','식품','가전','가전'],
                   '월':['1월','2월','1월','2월'],
                  '매출':[200,250,500,550]})
df

  카테고리   월   매출
0   식품  1월  200
1   식품  2월  250
2   가전  1월  500
3   가전  2월  550

In [63]:
df.pivot(index='카테고리', columns='월', values='매출')

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [64]:
# 2. 도서관 대출 데이터를 담은 DataFrame를 만들고,
# pivot을 이용해 도서관별 장르 대출 건수를 출력하세요
df = pd.DataFrame({'도서관': ['중앙','중앙','시립','시립'],
                   '장르':['소설','과학','소설','과학'],
                  '대출건수':[120,45,95,60]})
df

  도서관  장르  대출건수
0  중앙  소설   120
1  중앙  과학    45
2  시립  소설    95
3  시립  과학    60

In [65]:
df.pivot(index='도서관', columns='장르', values='대출건수')

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [67]:
# 3. 호텔 예약 데이터를 담은 DataFrame를 만들고,
# pivot을 이용해 지점별 객실 유형 예약 건수를 출력하세요
df = pd.DataFrame({'지점': ['서울','서울','부산','부산'],
                   '객실유형':['싱글룸','더블룸','싱글룸','더블룸'],
                  '예약건수':[45,30,50,35]})
df

   지점 객실유형  예약건수
0  서울  싱글룸    45
1  서울  더블룸    30
2  부산  싱글룸    50
3  부산  더블룸    35

In [68]:
df.pivot(index='지점', columns='객실유형', values='예약건수')

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45